app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("description", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)